NUM_CLIENTS = 100        # Количество клиентов
NUM_EMPLOYEES = 15       # Максимальное количество сотрудников
NUM_APPOINTMENTS = 200   # Количество записей
NUM_SERVICES = 20        # Количество услуг

MANAGERIAL_POSITIONS = {
    'Администратор салона': 2,
    'Арт-директор': 1
}

POSITIONS = [
    ('Мастер маникюра', 'Специалист по уходу за ногтями'),
    ('Парикмахер', 'Специалист по стрижкам и укладкам'),
    ('Косметолог', 'Специалист по уходу за кожей лица и тела'),
    ('Колорист', 'Специалист по окрашиванию волос'),
    ('Стилист-имиджмейкер', 'Профессионал по созданию индивидуального образа'),
    ('Мастер по наращиванию ресниц', 'Специалист по lash-услугам'),
    ('Визажист', 'Эксперт по макияжу для мероприятий и фотосессий'),
    ('Специалист по депиляции', 'Профессионал по эпиляции и шугарингу'),
    ('Мастер перманентного макияжа', 'Специалист по татуажу бровей и губ'),
    ('Косметолог-эстетист', 'Специалист по уходовым процедурам для лица'),
    ('Массажист', 'Профессионал по релаксационному и лимфодренажному массажу'),
    ('Администратор салона', 'Сотрудник ресепшена и координатор услуг'),
    ('Арт-директор', 'Куратор художественного направления салона')
]

SERVICE_LIST = [
    ('Маникюр классический', 'Стандартный маникюр без покрытия', 1500, 60),
    ('Маникюр с покрытием гель-лак', 'Маникюр с долговременным покрытием', 2500, 90),
    ('Педикюр классический', 'Стандартный педикюр без покрытия', 2000, 90),
    ('Педикюр с покрытием гель-лак', 'Педикюр с долговременным покрытием', 3500, 120),
    ('Стрижка женская', 'Классическая стрижка для женщин', 2000, 90),
    ('Стрижка мужская', 'Классическая стрижка для мужчин', 1500, 60),
    ('Окрашивание волос', 'Полное окрашивание волос', 4000, 180),
    ('Чистка лица базовая', 'Глубокая чистка лица', 3000, 120),
    ('Чистка лица аппаратная', 'Аппаратная чистка лица', 4000, 150),
    ('Массаж спины', 'Расслабляющий массаж спины', 2500, 60),
    ('Массаж всего тела', 'Общий массаж всего тела', 5000, 120),
    ('Наращивание ресниц', 'Классическое наращивание ресниц', 3000, 120),
    ('Перманентный макияж бровей', 'Татуаж бровей', 8000, 180),
    ('Шугаринг глубокое бикини', 'Удаление волос сахарной пастой', 1500, 60),
    ('Шугаринг ног полностью', 'Удаление волос сахарной пастой', 2500, 90),
    ('Ламинирование ресниц', 'Процедура ламинирования ресниц', 2000, 90),
    ('Ботокс для волос', 'Восстановление волос с помощью ботокса', 3500, 120),
    ('Укладка волос', 'Создание праздничной укладки', 1500, 60),
    ('Окрашивание бровей', 'Профессиональное окрашивание бровей', 1000, 30),
    ('Коррекция бровей', 'Формирование идеальной формы бровей', 800, 30)
]

